## Filtering rows

Basic operations on several tables in a sql database:
- select
- count
- distinct
- where and
- where and or
- between
- where in
- null
- like and not like

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///imdb.db

'Connected: @imdb.db'

List tables in db

In [3]:
%sql select name from sqlite_master where type = 'table'

 * sqlite:///imdb.db
Done.

[('films',), ('people',), ('reviews',), ('roles',)]

## Filtering Rows

In [6]:
%sql select * from films limit 5;

 * sqlite:///imdb.db
Done.

[(1, "Intolerance: Love's Struggle Throughout the Ages", 1916, 'USA', 123, None, 'Not Rated', None, 385907),
 (2, 'Over the Hill to the Poorhouse', 1920, 'USA', 110, None, None, 3000000, 100000),
 (3, 'The Big Parade', 1925, 'USA', 151, None, 'Not Rated', None, 245000),
 (4, 'Metropolis', 1927, 'Germany', 145, 'German', 'Not Rated', 26435, 6000000),
 (5, "Pandora's Box", 1929, 'Germany', 110, 'German', 'Not Rated', 9950, None)]

In [7]:
%sql select * from people limit 5;

 * sqlite:///imdb.db
Done.

[(1, '50 Cent', '1975-07-06', None),
 (2, 'A. Michael Baldwin', '1963-04-04', None),
 (3, 'A. Raven Cruz', None, None),
 (4, 'A.J. Buckley', '1978-02-09', None),
 (5, 'A.J. DeLucia', None, None)]

In [8]:
%sql select * from roles limit 5;

 * sqlite:///imdb.db
Done.

[(1, 1, 1630, 'director'),
 (2, 1, 4843, 'actor'),
 (3, 1, 5050, 'actor'),
 (4, 1, 8175, 'actor'),
 (5, 2, 3000, 'director')]

In [9]:
%sql select * from reviews limit 5;

 * sqlite:///imdb.db
Done.

[(1, 3934, 588, 432, 7.1, 203461, 46000),
 (2, 3405, 285, 267, 6.4, 149998, 0),
 (3, 478, 65, 29, 3.2, 8465, 491),
 (4, 74, 83, 25, 7.6, 7071, 930),
 (5, 1254, 1437, 224, 8.0, 241030, 13000)]

whos is the first person in films table?

In [14]:
%sql select name from people limit 1;

 * sqlite:///imdb.db
Done.

[('50 Cent',)]

Get the title and relase year of every film from the films table.

In [17]:
%sql select title,release_year from films limit 10;

 * sqlite:///imdb.db
Done.

[("Intolerance: Love's Struggle Throughout the Ages", 1916),
 ('Over the Hill to the Poorhouse', 1920),
 ('The Big Parade', 1925),
 ('Metropolis', 1927),
 ("Pandora's Box", 1929),
 ('The Broadway Melody', 1929),
 ("Hell's Angels", 1930),
 ('A Farewell to Arms', 1932),
 ('42nd Street', 1933),
 ('She Done Him Wrong', 1933)]

Get all the unique countries represented in the films table.

In [23]:
%sql select distinct country from films limit 5;

 * sqlite:///imdb.db
Done.

[('USA',), ('Germany',), ('Japan',), ('Denmark',), ('UK',)]

How many records are contained in the reviews table?

In [27]:
%sql select count(*) from reviews

 * sqlite:///imdb.db
Done.

[(4968,)]

Count the number of unique birth dates in the people table.

In [28]:
%sql select count(distinct birthdate) from people;

 * sqlite:///imdb.db
Done.

[(5398,)]

Get all details for all films released in 2016.

In [31]:
%sql select * from films where release_year = 2016 limit 10;

 * sqlite:///imdb.db
Done.

[(4821, '10 Cloverfield Lane', 2016, 'USA', 104, 'English', 'PG-13', 71897215, 15000000),
 (4822, '13 Hours', 2016, 'USA', 144, 'English', 'R', 52822418, 50000000),
 (4823, "A Beginner's Guide to Snuff", 2016, 'USA', 87, 'English', None, None, None),
 (4824, 'Airlift', 2016, 'India', 130, 'Hindi', None, None, 4400000),
 (4825, 'Alice Through the Looking Glass', 2016, 'USA', 113, 'English', 'PG', 76846624, 170000000),
 (4826, 'Allegiant', 2016, 'USA', 120, 'English', 'PG-13', 66002193, 110000000),
 (4827, "Alleluia! The Devil's Carnival", 2016, 'USA', 97, 'English', None, None, 500000),
 (4828, 'Antibirth', 2016, 'USA', 94, 'English', None, None, 3500000),
 (4829, 'Bad Moms', 2016, 'USA', 100, 'English', 'R', 55461307, 20000000),
 (4830, 'Bad Moms', 2016, 'USA', 100, 'English', 'R', 55461307, 20000000)]

Get the number of films released before 2000.

In [32]:
%sql select count(*) from films where release_year < 2000;

 * sqlite:///imdb.db
Done.

[(2674,)]

Get the name and birth date of the person born on November 11th, 1974.

In [34]:
%sql select * from people where birthdate = '1974-11-11';

 * sqlite:///imdb.db
Done.

[(4792, 'Leonardo DiCaprio', '1974-11-11', None)]

Get the number of Hindi language films.

In [35]:
%sql select count(*) from films where language = 'Hindi';

 * sqlite:///imdb.db
Done.

[(56,)]

Get all details for Spanish language films released after 2000, but before 2010.

In [38]:
%sql select * from films where language = 'Spanish' and (release_year > 2000 and release_year < 2010) limit 10;

 * sqlite:///imdb.db
Done.

[(1695, 'Y Tu Mamá También', 2001, 'Mexico', 106, 'Spanish', 'R', 13622333, 2000000),
 (1757, 'El crimen del padre Amaro', 2002, 'Mexico', 118, 'Spanish', 'R', 5709616, 1800000),
 (1807, 'Mondays in the Sun', 2002, 'Spain', 113, 'Spanish', 'R', 146402, 4000000),
 (2173, 'Live-In Maid', 2004, 'Argentina', 83, 'Spanish', 'Unrated', None, 800000),
 (2175, 'Maria Full of Grace', 2004, 'Colombia', 101, 'Spanish', 'R', 6517198, 3000000),
 (2246, 'The Holy Girl', 2004, 'Argentina', 106, 'Spanish', 'R', 304124, 1400000),
 (2263, 'The Sea Inside', 2004, 'Spain', 125, 'Spanish', 'PG-13', 2086345, 10000000),
 (2458, 'The Legend of Zorro', 2005, 'USA', 129, 'Spanish', 'PG', 45356386, 75000000),
 (2542, 'Captain Alatriste: The Spanish Musketeer', 2006, 'Spain', 145, 'Spanish', None, None, 24000000),
 (2646, "Pan's Labyrinth", 2006, 'Spain', 112, 'Spanish', 'R', 37623143, 13500000)]

Get the title and release year for films released in the 90s  to only include French or Spanish language films.

In [44]:
%%sql 
select title, release_year from films where (release_year >= 1990 and release_year < 2000) 
and (language = 'French' or language = 'Spanish') limit 10;

 * sqlite:///imdb.db
Done.

[('El Mariachi', 1992),
 ('Les visiteurs', 1993),
 ('The Horseman on the Roof', 1995),
 ("When the Cat's Away", 1996),
 ('The Chambermaid on the Titanic', 1997),
 ('The Swindle', 1997),
 ('La otra conquista', 1998),
 ('Les couloirs du temps: Les visiteurs II', 1998),
 ('Tango', 1998),
 ('The Red Violin', 1998)]

In [45]:
%%sql 
select title, release_year from films where (release_year >= 1990 and release_year < 2000) 
and language in ('French','Spanish') limit 10;

 * sqlite:///imdb.db
Done.

[('El Mariachi', 1992),
 ('Les visiteurs', 1993),
 ('The Horseman on the Roof', 1995),
 ("When the Cat's Away", 1996),
 ('The Chambermaid on the Titanic', 1997),
 ('The Swindle', 1997),
 ('La otra conquista', 1998),
 ('Les couloirs du temps: Les visiteurs II', 1998),
 ('Tango', 1998),
 ('The Red Violin', 1998)]

Get the title and release year of all films released between 1990 and 2000 (inclusive).
And have budgets over 100 million and spanish language

In [51]:
%%sql
select title,release_year from films where release_year between 1990 and 2000
and budget > 100000000 and language = 'Spanish';

 * sqlite:///imdb.db
Done.

[('Tango', 1998), ('Tango', 1998)]

Get the title and release year of all films released in 1990 or 2000 that were longer than two hours. Remember, duration is in minutes

In [53]:
%%sql
select title, release_year from films where release_year in (1990,2000)
and duration > 120 limit 5;

 * sqlite:///imdb.db
Done.

[('Dances with Wolves', 1990),
 ('Die Hard 2', 1990),
 ('Ghost', 1990),
 ('Goodfellas', 1990),
 ("Mo' Better Blues", 1990)]

Get the names of people who are still alive, i.e. whose death date is missing.

In [55]:
%sql select * from people where deathdate is NULL limit 5;

 * sqlite:///imdb.db
Done.

[(1, '50 Cent', '1975-07-06', None),
 (2, 'A. Michael Baldwin', '1963-04-04', None),
 (3, 'A. Raven Cruz', None, None),
 (4, 'A.J. Buckley', '1978-02-09', None),
 (5, 'A.J. DeLucia', None, None)]

Get the names of all people whose names begin with 'B'.

In [60]:
%sql select name from people where name like "B%" limit 5;

 * sqlite:///imdb.db
Done.

[('B.J. Novak',),
 ('Babak Najafi',),
 ('Babar Ahmed',),
 ('Bahare Seddiqi',),
 ('Bai Ling',)]

Get the names of people whose names have 'r' as the second letter.

In [64]:
%sql select name from people where name like "_r%" limit 5;

 * sqlite:///imdb.db
Done.

[('Ara Celi',),
 ('Aramis Knight',),
 ('Arben Bajraktaraj',),
 ('Arcelia Ramírez',),
 ('Archie Kao',)]